app/Controllers/AdminController.php

SELECT *
FROM `estabelecimento_evento` `ee`
JOIN `usuario` `u` ON `u`.`id_usuario` = `ee`.`id_usuario`
WHERE `u`.`status_usuario` = 'ativo'
AND `ee`.`tipo` = 'evento'
---
    public function index()
    {
        $db = \Config\Database::connect();
        $userModel = new UsuarioModel();

        // 1. Filtro de Status Implícito: Apenas dados vinculados a usuários ATIVOS
        $idEvento = $this->request->getGet('id_evento');

        // Seleção de filtros de evento sazonal para carregar no dropdown da View
        $eventosFiltro = $db->table('estabelecimento_evento ee')
            ->join('usuario u', 'u.id_usuario = ee.id_usuario')
            ->where('u.status_usuario', 'ativo')
            ->where('ee.tipo', 'evento')
            ->get()->getResultArray() ?? [];

SELECT COUNT(*) AS `numrows`
FROM `pesquisa` `p`
JOIN `estabelecimento_evento` `ee` ON `ee`.`id_estabelecimento` = `p`.`id_estabelecimento`
JOIN `usuario` `u` ON `u`.`id_usuario` = `ee`.`id_usuario`
WHERE `u`.`status_usuario` = 'ativo'
---
            $kpis['impacto_economico'] = $builder->selectSum('p.valor_gasto_estimado')->get()->getRowArray()['valor_gasto_estimado'] ?? 0;

            // 2. Volume Turístico Geral (Pesquisas + Fluxos)
            $totalRespostas = $db->table('pesquisa p')
                ->join('estabelecimento_evento ee', 'ee.id_estabelecimento = p.id_estabelecimento')
                ->join('usuario u', 'u.id_usuario = ee.id_usuario')
                ->where('u.status_usuario', 'ativo')
                ->countAllResults();

SELECT SUM(`fo`.`quartos_ocupados`) AS `oc`, SUM(`fo`.`capacidade_maxima_quartos`) AS `cap`
FROM `fluxos_ocupacao` `fo`
JOIN `estabelecimento_evento` `ee` ON `ee`.`id_estabelecimento` = `fo`.`id_estabelecimento`
JOIN `usuario` `u` ON `u`.`id_usuario` = `ee`.`id_usuario`
WHERE `u`.`status_usuario` = 'ativo'
AND `ee`.`setor` = 'hospedagem'
---

            // 3. Taxa de Ocupação Hoteleira
            if ($db->tableExists('fluxos_ocupacao')) {
                $hotelQuery = $db->table('fluxos_ocupacao fo')
                    ->join('estabelecimento_evento ee', 'ee.id_estabelecimento = fo.id_estabelecimento')
                    ->join('usuario u', 'u.id_usuario = ee.id_usuario')
                    ->where('u.status_usuario', 'ativo')
                    ->where('ee.setor', 'hospedagem')
                    ->selectSum('fo.quartos_ocupados', 'oc')
                    ->selectSum('fo.capacidade_maxima_quartos', 'cap')
                    ->get()->getRowArray();

SELECT AVG(`p`.`satisfacao_estrelas`) AS `satisfacao_estrelas`
FROM `pesquisa` `p`
JOIN `estabelecimento_evento` `ee` ON `ee`.`id_estabelecimento` = `p`.`id_estabelecimento`
JOIN `usuario` `u` ON `u`.`id_usuario` = `ee`.`id_usuario`
WHERE `u`.`status_usuario` = 'ativo'
SELECT `p`.`nps`
FROM `pesquisa` `p`
JOIN `estabelecimento_evento` `ee` ON `ee`.`id_estabelecimento` = `p`.`id_estabelecimento`
JOIN `usuario` `u` ON `u`.`id_usuario` = `ee`.`id_usuario`
WHERE `u`.`status_usuario` = 'ativo'
---
            }

            // 4. Índice de Satisfação Média (Estrelas)
            $kpis['satisfacao_media'] = round($db->table('pesquisa p')
                ->join('estabelecimento_evento ee', 'ee.id_estabelecimento = p.id_estabelecimento')
                ->join('usuario u', 'u.id_usuario = ee.id_usuario')
                ->where('u.status_usuario', 'ativo')
                ->selectAvg('p.satisfacao_estrelas')
                ->get()->getRowArray()['satisfacao_estrelas'] ?? 0, 1);

            // 5. Cálculo Convencional de Mercado para NPS (% Promotores - % Detratores)
            $npsData = $db->table('pesquisa p')
                ->join('estabelecimento_evento ee', 'ee.id_estabelecimento = p.id_estabelecimento')
                ->join('usuario u', 'u.id_usuario = ee.id_usuario')
                ->where('u.status_usuario', 'ativo')
                ->select('p.nps')->get()->getResultArray();

SELECT `p`.`cidade_origem`, COUNT(*) as total
FROM `pesquisa` `p`
JOIN `estabelecimento_evento` `ee` ON `ee`.`id_estabelecimento` = `p`.`id_estabelecimento`
JOIN `usuario` `u` ON `u`.`id_usuario` = `ee`.`id_usuario`
WHERE `u`.`status_usuario` = 'ativo'
GROUP BY `p`.`cidade_origem`
ORDER BY `total` DESC
 LIMIT 5
SELECT `ee`.`setor`, COUNT(*) as total
FROM `pesquisa` `p`
JOIN `estabelecimento_evento` `ee` ON `ee`.`id_estabelecimento` = `p`.`id_estabelecimento`
JOIN `usuario` `u` ON `u`.`id_usuario` = `ee`.`id_usuario`
WHERE `u`.`status_usuario` = 'ativo'
GROUP BY `ee`.`setor`
SELECT `p`.`motivo_visita`, COUNT(*) as total
FROM `pesquisa` `p`
JOIN `estabelecimento_evento` `ee` ON `ee`.`id_estabelecimento` = `p`.`id_estabelecimento`
JOIN `usuario` `u` ON `u`.`id_usuario` = `ee`.`id_usuario`
WHERE `u`.`status_usuario` = 'ativo'
GROUP BY `p`.`motivo_visita`
SELECT `p`.`local_hospedagem`, COUNT(*) as total
FROM `pesquisa` `p`
JOIN `estabelecimento_evento` `ee` ON `ee`.`id_estabelecimento` = `p`.`id_estabelecimento`
JOIN `usuario` `u` ON `u`.`id_usuario` = `ee`.`id_usuario`
WHERE `u`.`status_usuario` = 'ativo'
AND `p`.`tempo_permanencia` = 'dormir'
GROUP BY `p`.`local_hospedagem`
---

            // --- GRÁFICOS COMPORTAMENTAIS (População dos Arrays de Exibição) ---
            // Cidades Origem (Top 5)
            $cidades = $db->table('pesquisa p')->join('estabelecimento_evento ee', 'ee.id_estabelecimento = p.id_estabelecimento')->join('usuario u', 'u.id_usuario = ee.id_usuario')->where('u.status_usuario', 'ativo')->select('p.cidade_origem, COUNT(*) as total')->groupBy('p.cidade_origem')->orderBy('total', 'DESC')->limit(5)->get()->getResultArray();
            $charts['cidades'] = ['labels' => json_encode(array_column($cidades, 'cidade_origem')), 'valores' => json_encode(array_map('intval', array_column($cidades, 'total')))];

            // Setores
            $setores = $db->table('pesquisa p')->join('estabelecimento_evento ee', 'ee.id_estabelecimento = p.id_estabelecimento')->join('usuario u', 'u.id_usuario = ee.id_usuario')->where('u.status_usuario', 'ativo')->select('ee.setor, COUNT(*) as total')->groupBy('ee.setor')->get()->getResultArray();
            $charts['setores'] = ['labels' => json_encode(array_column($setores, 'setor')), 'valores' => json_encode(array_map('intval', array_column($setores, 'total')))];

            // Motivos da Visita
            $motivos = $db->table('pesquisa p')->join('estabelecimento_evento ee', 'ee.id_estabelecimento = p.id_estabelecimento')->join('usuario u', 'u.id_usuario = ee.id_usuario')->where('u.status_usuario', 'ativo')->select('p.motivo_visita, COUNT(*) as total')->groupBy('p.motivo_visita')->get()->getResultArray();
            $charts['motivos'] = ['labels' => json_encode(array_column($motivos, 'motivo_visita')), 'valores' => json_encode(array_map('intval', array_column($motivos, 'total')))];

            // Perfil de Hospedagem (Apenas tempo_permanencia = 'dormir')
            $hosp = $db->table('pesquisa p')->join('estabelecimento_evento ee', 'ee.id_estabelecimento = p.id_estabelecimento')->join('usuario u', 'u.id_usuario = ee.id_usuario')->where('u.status_usuario', 'ativo')->where('p.tempo_permanencia', 'dormir')->select('p.local_hospedagem, COUNT(*) as total')->groupBy('p.local_hospedagem')->get()->getResultArray();

SELECT *
FROM `usuario` `u`
JOIN `estabelecimento_evento` `ee` ON `ee`.`id_usuario` = `u`.`id_usuario`
WHERE `u`.`status_usuario` = 'pendente'
AND `u`.`role_usuario` = 'lojista'
---
        }

        // Carrega o Onboarding das solicitações pendentes de Lojistas
        $solicitacoes = $db->table('usuario u')
            ->join('estabelecimento_evento ee', 'ee.id_usuario = u.id_usuario')
            ->where('u.status_usuario', 'pendente')
            ->where('u.role_usuario', 'lojista')
            ->get()->getResultArray() ?? [];